Repository: Abduvohid26/webappbot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru, uz

source: start_message
ru: 👋 Привет, {name}! Рады видеть вас в BestAI боте! 😊 Как я могу вам помочь? 🤖💬
uz: 👋 Assalomu alaykum, {name}! Sizni BestAI botida ko‘rib turganimizdan xursandmiz! 😊 Sizga qanday yordam bera olaman? 🤖💬

source: change_lang
ru: Выберите язык
uz: Tilni Tanlang

source: 🗣 Voice to Text
ru: 🗣 Голос в текст
uz: 🗣 Ovozni matnga aylantirish

source: 📝 Text to Voice
ru: 📝 Текст в голос
uz: 📝 Matnni ovozga aylantirish

source: 🏞 Image Analyze
ru: 🏞 Анализ изображения
uz: 🏞 Tasvirni tahlil qilish

source: 📁 Document Q&A
ru: 📁 Вопросы и ответы по документам
uz: 📁 Hujjatga oid

source: 📱 Text summarization
ru: 📱 Резюмирование текста
uz: 📱 Matnni qisqacha bayon qilish

source: ♻️ Translate
ru: ♻️ Перевод
uz: ♻️ Tarjima qilish

source: 🗣 Voice Translate
ru: 🗣 Перевод с голоса
uz: 🗣 Ovozni tarjima qilish

source: 📹 Video translate
ru: 📹 Перевод видео
uz: 📹 Video tarjima

source: 🌍 Change Language
ru: 🌍 Изменить язык
uz: 🌍 Til o‘zgartirish

source: 🤖 AI Assistant
ru: 🤖 Искусственный интеллект
uz: 🤖 AI yordamchisi

source: voice_to_text
ru: Отправьте мне голосовое сообщение, я превращу его в текст
uz: Menga ovozli xabar yuboring, uni matnga aylantirib beraman

source: back_to_main_menu
ru: ↩️ Вернуться в главное меню
uz: ↩️ Asosiy menyuga qaytish

source: main_menu
ru: ⚙️ Главное меню
uz: ⚙️ Asosiy Menu

source: voice_processing
ru: Голос преобразуется в текст, подождите ⌚️⏳
uz: Ovoz matnga o'zgartirilmoqda, kuting ⌚️⏳

source: get_answer_button
ru: 📝 Получить ответ
uz: 📝 Javobni olish

source: press_button_to_get_answer
ru: Нажмите кнопку, чтобы получить ответ 🔒
uz: Javobni olish uchun tugmani bosing 🔒

source: send_voice_again
ru: Отправьте голосовое сообщение еще раз !!!
uz: Qaytadan ovozli xabar yuboring !!!

source: please_send_voice
ru: Пожалуйста, отправьте голосовое сообщение !!!
uz: Iltimos, ovozli xabar yuboring !!!

source: send_text
ru: Отправьте мне текст, я превращу его в голосовое сообщение
uz: Menga matn yuboring, uni ovozli xabarga aylantirib beraman

source: text_to_voice_processing
ru: Текст преобразуется в голос, подождите ⌚️⏳
uz: Matn ovozga aylantirilmoqda, kuting ⌚️⏳

source: send_text_again
ru: Отправьте текст еще раз!
uz: Qaytadan matn yuboring!

source: please_send_text
ru: Пожалуйста, отправьте текст!
uz: Iltimos, matn yuboring!

source: send_image
ru: Отправьте мне изображение, я его проанализирую.
uz: Menga rasm yuboring, uni tahlil qilib beraman.

source: image_processing
ru: Изображение анализируется, подождите ⌚️⏳
uz: Rasm tahlil qilinmoqda, kuting ⌚️⏳

source: please_send_image
ru: Пожалуйста, отправьте изображение!
uz: Iltimos, rasm yuboring!

source: send_document
ru: 📁 Отправьте PDF, DOCX или TXT документ!
uz: 📁 PDF, DOCX yoki TXT hujjat yuboring!

source: please_send_document
ru: Пожалуйста, отправьте документ!
uz: Iltimos, hujjat yuboring!

source: no_text_found
ru: В документе не найдено никакого текста!
uz: Hujjatda hech qanday matn topilmadi!

source: ask_document_info
ru: Хорошо! Теперь напишите, что вам нужно из документа.
uz: Yaxshi! Endi hujjatdan nima kerakligini yozing.

source: ask_what_needed_from_document
ru: Пожалуйста, напишите, что вам нужно из документа!
uz: Iltimos, hujjatdan nima kerakligini yozing!

source: document_text_not_found
ru: Текст документа не найден. Пожалуйста, отправьте документ заново.
uz: Hujjat matni topilmadi. Iltimos, qaytadan hujjat yuboring.

source: text_summarization_intro
ru: 📱 Резюмирование текста – возможность превратить длинный текст в краткое и точное содержание 📄 Отправьте текст
uz: 📱 Matnni umumlashtirish – uzoq matnlarni qisqacha va aniq mazmunga aylantirish imkoniyati 📄 Matni yuboring

source: summarize_text
ru: Обобщите текст ->:
uz: Matnni umumlashtiring ->:

source: choose_translation_language
ru: На какой язык хотите перевести? Выберите!
uz: Qaysi tilga tarjima qilmoqchisiz? Tanlang!

source: previous_button
ru: ⬅️ Назад
uz: ⬅️ Oldingi

source: next_button
ru: Вперед ➡️
uz: Keyingi ➡️

source: send_text_for_translation
ru: Отправьте текст, и я переведу его на {lang_name} язык!
uz: Text yuboring, men uni {lang_name} tiliga tarjima qilib beraman!

source: please_choose_language
ru: Пожалуйста, выберите язык
uz: Iltimos biror tilni tanlang

source: send_text_to_translate
ru: Отправьте текст для перевода !!!
uz: Tarjima qilish uchun text yuboring !!!

source: choose_second_language
ru: Выберите второй язык!
uz: Ikkinchi tilni Tanlang!

source: change_language_button
ru: 🌐 Изменить язык
uz: 🌐 Tillarni o'zgartirish

source: choose_first_language
ru: Выберите первый язык!
uz: Birinchi tilni Tanlang!

source: choose_option
ru: Выберите!
uz: Tanlang !

source: Now send me the text
ru: Теперь отправьте мне текст
uz: Endi menga matn yuboring

source: send_voice_message
ru: Отправьте мне голосовое сообщение !!!
uz: Menga ovozli xabar yuboring !!!

source: choose_language1
ru: Выберите один из языков !!!
uz: Tillardan birini tanlang !!!

source: language_not_selected
ru: Язык не выбран! Пожалуйста, сначала выберите язык.
uz: Til tanlanmagan! Iltimos, avval tilni tanlang.

source: send_voice_or_audio_message
ru: Отправьте мне голосовое или аудио сообщение !!!
uz: Menga ovozli yoki audio xabar yuboring !!!

source: send_video
ru: 🎥 Отправьте видео, я переведу его!
uz: 🎥 Video yuboring, men uni tarjima qilib beraman!

source: video_translating
ru: ⏳ Идет перевод видео, подождите ...
uz: ⏳ Videodan translate qilinmoqda kuting ...

source: video_no_audio
ru: ❌ В видео нет аудио! Пожалуйста, отправьте видео в другом формате.
uz: ❌ Videodan audio olinmadi! Iltimos, boshqa formatdagi video yuboring.

source: video_error
ru: ❌ Произошла ошибка: Неподдерживаемый формат или Отправьте видео без музыки.
uz: ❌ Xatolik yuz berdi: Qo‘llab-quvvatlanmaydigan format yoki Musiqasiz video yuboring.

source: please_send_video
ru: Пожалуйста, отправьте видео !!!
uz: Iltimos, video yuboring !!!

source: language_changed
ru: Язык успешно изменен!
uz: Til muvaffaqiyatli o‘zgartirildi!

source: please_join_all_channels
ru: Пожалуйста, сначала подпишитесь на все каналы!
uz: Iltimos, avval barcha kanallarga a’zo bo‘ling!

source: check_subscription
ru: 🔄 Проверить
uz: 🔄 Tekshirish

source: salom_message_none
ru: Ассаламу алейкум {full_name} 👋 Чем я могу вам помочь? 🤖💬 Отправьте мне текст или изображение, и я отвечу ✅✅✅
uz: Assalamu Aleykum {full_name} 👋 Sizga qanday yordam bera olishim mumkin? 🤖💬 Menga text yoki rasm yuboring sizga javob beraman ✅✅✅

source: best_ai_bot
ru: @Javohir_aibot
uz: @Javohir_aibot

source: back_to_main_menu_other
ru: ↩️меню
uz: ↩️Asosiy

source: Speakerni Tanlng !!!
ru: Выберите диктора !!!
uz: Speakerni tanlang !!!

source: 👥 Do'st taklif qilish
ru: 👥 Пригласить друга

source: Bepul limit olish uchun dostingiz taklif qiling
ru: 🔹 Чтобы получить бесплатный лимит, пригласите друга! ⚠️ Ваши бесплатные лимиты закончились. Пригласите друга и получите 10 бесплатных лимитов за каждого приглашенного или приобретите Premium!
uz: 🔹 Bepul limit olish uchun do‘stingizni taklif qiling! ⚠️ Sizning bepul limitlaringiz tugadi. Yangi limit olish uchun do‘stingizni taklif qiling va har bir taklif uchun 10 ta bepul limitga ega bo‘ling yoki Premium sotib oling!

source: Siz taklif qilgan do‘stlar soni:
ru: Количество друзей, которых вы пригласили:

source: Qolgan bepul limittingiz:
ru: Оставшийся бесплатный лимит:

source: Premuium tarif
ru: 🎁 Премиум тариф

source: Sizning referal kodingiz:
ru: Ваш реферальный код:

source: 👥 Havolani dostlaringizga yuborib bepul limit oling
ru: 👥 Поделитесь этой ссылкой с друзьями и получите бесплатный лимит! Чтобы получить лимит, ваши друзья должны присоединиться к боту именно по этой ссылке.
uz: 👥 Do‘stlaringiz bilan ushbu havolani ulashing va bepul limitga ega bo‘ling! Limit olish uchun do‘stlaringiz aynan shu havola orqali botga qo‘shilishi kerak.
